docs/susie.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-08 Fri 10:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Fine Mapping with Susie</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Nicholas Knoblauch">
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Fine Mapping with Susie</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb18966e">Running susie</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgb18966e" class="outline-2">
<h2 id="orgb18966e">Running susie</h2>
<div class="outline-text-2" id="text-orgb18966e">
<p>
Below is the snakemake code for running susie.  It relies on enrichment estimates from torus.
</p>


<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">torus_anno_r</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">gwasf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"{gwas}_gwas.h5"</span>,
        <span style="color: #FF9326;">annof</span>=config_d[<span style="color: #FFABAB;">'ANNO'</span>] +<span style="color: #FFABAB;">"{anno}.txt.gz"</span>,
        <span style="color: #FF9326;">mvp</span>=<span style="color: #FFABAB;">"torus_{gwas}_{anno}_mv.RDS"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">chrom</span>=<span style="color: #FFABAB;">"{chrom}"</span>,
        <span style="color: #FF9326;">start</span>=<span style="color: #FFABAB;">"{start}"</span>,
        <span style="color: #FF9326;">end</span>=<span style="color: #FFABAB;">"{end}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">outf</span>=config_d[<span style="color: #FFABAB;">'ANNO'</span>]+<span style="color: #FFABAB;">"prior_{gwas}_{anno}/{chrom}_{start}_{end}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/gen_susie_prior.R"</span>
</pre>
</div>

<p>
<code>gen_susie_prior.R</code> belongs to the rule <code>torus_anno_r</code>, and creates SNP-level annotations from torus estimates of
enrichment.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(ldmap)
<span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(readr)
<span style="color: #C04040;">library</span>(tidyr)
<span style="color: #C04040;">library</span>(EigenH5)

gwasf <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"gwasf"</span>]]
ld_id <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"region"</span>]]
<span style="color: #C8FF03;">if</span>(is.null(ld_id)){
  ichrom <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"chrom"</span>]]
  istart <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"start"</span>]]
  iend <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"end"</span>]]
  stopifnot(!is.null(ichrom),
            !is.null(istart),
            !is.null(iend),
            !is.na(as.integer(ichrom)),
            !is.na(as.integer(istart)),
            !is.na(as.integer(iend)))
  ldmr <span style="color: #C04040;">&lt;-</span> new_ldmap_region(as.integer(ichrom),
                           as.integer(istart),
                           as.integer(iend))

}<span style="color: #C8FF03;">else</span>{
  stopifnot(!is.null(ld_id),
            length(ld_id) == 1)
  ld_id <span style="color: #C04040;">&lt;-</span> as.integer(ld_id)
  ldmr <span style="color: #C04040;">&lt;-</span> ldetect_EUR[ld_id]
}

mvpf <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"mvp"</span>]]
annof <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"annof"</span>]]
outf <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"outf"</span>]]

stopifnot(!is.null(outf),
          !is.null(mvpf),
          !is.null(annof),
          file.exists(annof),
          file.exists(mvpf))

mvd <span style="color: #C04040;">&lt;-</span> readRDS(mvpf) <span style="color: #C04040;">%&gt;%</span>
  unnest(data) <span style="color: #C04040;">%&gt;%</span>
  select(term, estimate)
gwas_df <span style="color: #C04040;">&lt;-</span> ldmap::read_snp_region_h5(gwasf, ldmr, subcols = c(<span style="color: #FFABAB;">"snp_struct"</span>)) <span style="color: #C04040;">%&gt;%</span>
  rename(snp_pos = snp_struct) <span style="color: #C04040;">%&gt;%</span>
  mutate(snp_pos=clear_alleles(snp_pos))

annodf <span style="color: #C04040;">&lt;-</span> left_join(gwas_df,
                    read_delim(annof, delim = <span style="color: #FFABAB;">" "</span>) <span style="color: #C04040;">%&gt;%</span>
                    rename(snp_pos=SNP) <span style="color: #C04040;">%&gt;%</span> 
                    mutate(snp_pos = clear_alleles(ldmap:::parse_ldmap_SNP(snp_pos))))





intercept <span style="color: #C04040;">&lt;-</span> filter(mvd, term == <span style="color: #FFABAB;">"Intercept"</span>) <span style="color: #C04040;">%&gt;%</span>
  pull(estimate)

pivot_longer(annodf,
    cols = c(-snp_pos),
    names_to = c(<span style="color: #FFABAB;">"term"</span>),
    values_to = c(<span style="color: #FFABAB;">"anno"</span>)) <span style="color: #C04040;">%&gt;%</span>
    mutate(term = stringr::str_remove(term, <span style="color: #FFABAB;">"_d$"</span>),
           anno = if_else(is.na(anno), 0, anno)) <span style="color: #C04040;">%&gt;%</span>
    inner_join(mvd) <span style="color: #C04040;">%&gt;%</span>
    group_by(snp_pos) <span style="color: #C04040;">%&gt;%</span>
    summarise(prior = 1 / (1 + exp(- (intercept + sum(anno * estimate))))) <span style="color: #C04040;">%&gt;%</span>
    saveRDS(outf)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">susie_pr</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">ldf</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] +<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/LDR/{chrom}_{start}_{end}.h5"</span>,
        <span style="color: #FF9326;">ldgf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>]+ <span style="color: #FFABAB;">"{gwas}_gwas_ldetect.RDS"</span>,
        <span style="color: #FF9326;">priorf</span>=config_d[<span style="color: #FFABAB;">'ANNO'</span>] +<span style="color: #FFABAB;">"prior_{gwas}_{anno_name}/{chrom}_{start}_{end}.RDS"</span>,
        <span style="color: #FF9326;">inputf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"{gwas}_gwas.h5"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">chrom</span>=<span style="color: #FFABAB;">"{chrom}"</span>,
        <span style="color: #FF9326;">start</span>=<span style="color: #FFABAB;">"{start}"</span>,
        <span style="color: #FF9326;">end</span>=<span style="color: #FFABAB;">"{end}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">outputf</span>=config_d[<span style="color: #FFABAB;">'FINEMAP'</span>]+<span style="color: #FFABAB;">"susie_{gwas}_{anno_name}/{chrom}_{start}_{end}.RDS"</span>,
        <span style="color: #FF9326;">output_df</span> = config_d[<span style="color: #FFABAB;">'FINEMAP'</span>]+<span style="color: #FFABAB;">"susiedf_{gwas}_{anno_name}/{chrom}_{start}_{end}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/susie_r.R"</span>        

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">susie_pn_files</span>(<span style="color: #B46DCC;">wildcards</span>):
      <span style="color: #FF9326;">reg</span> = ldetect_data[<span style="color: #B46DCC;">int</span>(<span style="color: #B46DCC;">wildcards</span>.region_id)-1]
      <span style="color: #FF9326;">rchrom</span> = reg[<span style="color: #FFABAB;">'chrom'</span>]
      <span style="color: #FF9326;">rstart</span> = reg[<span style="color: #FFABAB;">'start'</span>]
      <span style="color: #FF9326;">rend</span> = reg[<span style="color: #FFABAB;">'end'</span>]
      <span style="color: #FF9326;">region_id</span> = <span style="color: #B46DCC;">wildcards</span>.region_id
      <span style="color: #FF9326;">ranno</span> = <span style="color: #B46DCC;">wildcards</span>.anno
      <span style="color: #FF9326;">gwas</span> = <span style="color: #B46DCC;">wildcards</span>.gwas
      <span style="color: #C8FF03;">print</span>(<span style="color: #B46DCC;">wildcards</span>)
      <span style="color: #FF9326;">ldf</span> = config_d[<span style="color: #FFABAB;">'1KG'</span>] +f<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/LD/{rchrom}_{region_id}.h5"</span>,
      <span style="color: #FF9326;">ldgf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>]+ f<span style="color: #FFABAB;">"{gwas}_gwas_ldetect.RDS"</span>,
      <span style="color: #FF9326;">priorf</span>=config_d[<span style="color: #FFABAB;">'ANNO'</span>] +f<span style="color: #FFABAB;">"prior_{gwas}_{ranno}/{rchrom}_{rstart}_{rend}.RDS"</span>,
      <span style="color: #FF9326;">inputf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>] +f<span style="color: #FFABAB;">"{gwas}_gwas.h5"</span>
      <span style="color: #FF9326;">ret_dict</span> = {
            <span style="color: #FFABAB;">'ldf'</span>: ldf,
            <span style="color: #FFABAB;">'ldgf'</span>: ldgf,
            <span style="color: #FFABAB;">'priorf'</span>: priorf,
            <span style="color: #FFABAB;">'inputf'</span>:inputf
      }
      <span style="color: #C8FF03;">return</span> ret_dict

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">susie_pn</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #B46DCC;">unpack</span>(susie_pn_files)
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">region_id</span>=<span style="color: #FFABAB;">"{region_id}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">outputf</span>=config_d[<span style="color: #FFABAB;">'FINEMAP'</span>]+<span style="color: #FFABAB;">"torus_{gwas}_{anno}/{region_id}.RDS"</span>,
        <span style="color: #FF9326;">output_df</span> = config_d[<span style="color: #FFABAB;">'FINEMAP'</span>]+<span style="color: #FFABAB;">"susiedf_{gwas}_{anno}/{region_id}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/susie_r.R"</span>


</pre>
</div>
<p>
<code>susie_r</code> runs susie in the specified region
</p>
<div class="org-src-container">
<pre class="src src-R">
<span style="color: #C04040;">library</span>(ldmap)
<span style="color: #C04040;">library</span>(EigenH5)
<span style="color: #C04040;">library</span>(susieR)
<span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(purrr)

<span style="color: #FFE203;">ldmrfun</span> <span style="color: #C04040;">&lt;-</span> <span style="color: #C8FF03;">function</span>(snakemake){
  ld_id <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"region"</span>]] <span style="color: #C04040;">%||%</span> snakemake@params[[<span style="color: #FFABAB;">"region_id"</span>]]
  <span style="color: #C8FF03;">if</span>(is.null(ld_id)){
    ichrom <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"chrom"</span>]]
    istart <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"start"</span>]]
    iend <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"end"</span>]]
    stopifnot(!is.null(ichrom),
              !is.null(istart),
              !is.null(iend),
              !is.na(as.integer(ichrom)),
              !is.na(as.integer(istart)),
              !is.na(as.integer(iend)))
    ldmr <span style="color: #C04040;">&lt;-</span> new_ldmap_region(as.integer(ichrom),
                             as.integer(istart),
                             as.integer(iend))
  }<span style="color: #C8FF03;">else</span>{
    stopifnot(!is.null(ld_id),
              length(ld_id)==1)
    ld_id <span style="color: #C04040;">&lt;-</span> as.integer(ld_id)
    ldmr <span style="color: #C04040;">&lt;-</span> ldetect_EUR[ld_id]
  }
  <span style="color: #C8FF03;">return</span>(ldmr)
}
ldmr <span style="color: #C04040;">&lt;-</span> ldmrfun(snakemake)



ld_regions <span style="color: #C04040;">&lt;-</span> readRDS(snakemake@input[[<span style="color: #FFABAB;">"ldgf"</span>]]) <span style="color: #C04040;">%&gt;%</span>
  mutate(ldetect_region=ldetect_EUR[region_id]) <span style="color: #C04040;">%&gt;%</span>
  filter(ldetect_region==ldmr)

p <span style="color: #C04040;">&lt;-</span> dim_h5(snakemake@input[[<span style="color: #FFABAB;">"inputf"</span>]], <span style="color: #FFABAB;">"snp/snp_struct"</span>)
gwas_df <span style="color: #C04040;">&lt;-</span> read_df_h5(snakemake@input[[<span style="color: #FFABAB;">"inputf"</span>]],
                      datapath = <span style="color: #FFABAB;">"snp"</span>,
                      subcols = c(<span style="color: #FFABAB;">"snp_struct"</span>, <span style="color: #FFABAB;">"beta"</span>, <span style="color: #FFABAB;">"se"</span>, <span style="color: #FFABAB;">"N"</span>),
                      offset = ld_regions$offset,
                      datasize = ld_regions$datasize
                      ) <span style="color: #C04040;">%&gt;%</span> rename(gwas_snp=snp_struct) <span style="color: #C04040;">%&gt;%</span>
  mutate(snp_pos=clear_alleles(gwas_snp)) <span style="color: #C04040;">%&gt;%</span> filter(!is.na(beta))
ld_df <span style="color: #C04040;">&lt;-</span> read_df_h5(snakemake@input[[<span style="color: #FFABAB;">"ldf"</span>]],<span style="color: #FFABAB;">"snp"</span>) <span style="color: #C04040;">%&gt;%</span>
  rename(ld_snp=snp_struct) <span style="color: #C04040;">%&gt;%</span>
  mutate(ld_id=1:n(),snp_pos=clear_alleles(ld_snp))

run_df <span style="color: #C04040;">&lt;-</span> inner_join(ld_df,gwas_df,by=<span style="color: #FFABAB;">"snp_pos"</span>) <span style="color: #C04040;">%&gt;%</span> mutate(am=allele_match(gwas_snp,ld_snp),am=if_else(is.na(am),factor(<span style="color: #FFABAB;">"perfect_match"</span>,levels=levels(am)),am),beta=if_else(am==<span style="color: #FFABAB;">"reverse_match"</span>,-beta,beta)) <span style="color: #C04040;">%&gt;%</span> group_by(ld_id)  <span style="color: #C04040;">%&gt;%</span> filter(N==max(N)) <span style="color: #C04040;">%&gt;%</span> slice(1) <span style="color: #C04040;">%&gt;%</span> ungroup() <span style="color: #C04040;">%&gt;%</span> arrange(ld_id)

R <span style="color: #C04040;">&lt;-</span> read_matrix_h5v(snakemake@input[[<span style="color: #FFABAB;">"ldf"</span>]],
                     <span style="color: #FFABAB;">"R"</span>,
                     run_df$ld_id,
                     run_df$ld_id)

run_df <span style="color: #C04040;">&lt;-</span> readRDS(snakemake@input[[<span style="color: #FFABAB;">"priorf"</span>]]) <span style="color: #C04040;">%&gt;%</span>
  select(snp_pos, prior) <span style="color: #C04040;">%&gt;%</span>
  inner_join(run_df)
stopifnot(nrow(run_df)==nrow(R))
h <span style="color: #C04040;">&lt;-</span> 0.1
h_p <span style="color: #C04040;">&lt;-</span> h / p
prior_v <span style="color: #C04040;">&lt;-</span> h_p * nrow(gwas_df)
sres <span style="color: #C04040;">&lt;-</span> susie_suff_stat(
  bhat = run_df$beta,
  shat = run_df$se,
  R = R,
  n = max(run_df$N),
  scaled_prior_variance = prior_v,
  prior_weights = run_df$prior,
  L = 1,
  null_weight = <span style="color: #99D6FF;">NULL</span>
)
mutate(run_df,pip=susie_get_pip(sres)) <span style="color: #C04040;">%&gt;%</span> 
  saveRDS(snakemake@output[[<span style="color: #FFABAB;">"output_df"</span>]])
saveRDS(sres, snakemake@output[[<span style="color: #FFABAB;">"outputf"</span>]])
</pre>
</div>



<div class="org-src-container">
<pre class="src src-snakemake">

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">aggregate_inputS</span>(<span style="color: #B46DCC;">wildcards</span>):
      <span style="color: #FF9326;">checkpoint_output</span> = <span style="color: #B46DCC;">checkpoints</span>.anno2torusp.get(**<span style="color: #B46DCC;">wildcards</span>).<span style="color: #B46DCC;">output</span>[<span style="color: #FFABAB;">'outputd'</span>]
      <span style="color: #FF9326;">i</span>=glob_wildcards(os.path.join(checkpoint_output, <span style="color: #FFABAB;">"{i}.RDS"</span>)).i
      <span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">print("cpo:"+checkpoint_output)</span>
      <span style="color: #FF9326;">manno</span> = <span style="color: #B46DCC;">wildcards</span>.anno
      <span style="color: #FF9326;">gwas</span> = <span style="color: #B46DCC;">wildcards</span>.gwas
      <span style="color: #FF9326;">ret_dict</span> = {<span style="color: #FFABAB;">'input_rds'</span>: [config_d[<span style="color: #FFABAB;">'FINEMAP'</span>]+f<span style="color: #FFABAB;">"susiedf_{gwas}_{manno}/{ti}.RDS"</span> <span style="color: #C8FF03;">for</span> ti <span style="color: #C8FF03;">in</span> i]}
      <span style="color: #C8FF03;">return</span> ret_dict


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">susie_agg_n</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #B46DCC;">unpack</span>(aggregate_inputS)
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">output_rds</span>=<span style="color: #FFABAB;">"susie_res/{gwas}_{anno}.RDS"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/concat_susie.R"</span>

</pre>
</div>




<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(purrr)
in_f <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"input_rds"</span>]]
saveRDS(map_df(in_f,readRDS),snakemake@output[[<span style="color: #FFABAB;">"output_rds"</span>]])
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nicholas Knoblauch</p>
<p class="date">Created: 2020-05-08 Fri 10:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
